{
  "Name": "ScalingPolicy",
  "Type": "AWS::AutoScaling::ScalingPolicy",
  "Documentation": "The AWS::AutoScaling::ScalingPolicy resource adds a scaling policy to an auto scaling group. A scaling policy specifies whether to scale the auto scaling group up or down, and by how much. For more information on scaling policies, see Scaling by Policy in the Auto Scaling Developer Guide.\nYou can use a scaling policy together with an CloudWatch alarm. An CloudWatch alarm can automatically initiate actions on your behalf, based on parameters you specify. A scaling policy is one type of action that an alarm can initiate. For a snippet showing how to create an Auto Scaling policy that is triggered by an CloudWatch alarm, see Auto Scaling Policy Triggered by CloudWatch Alarm.\nThis type supports updates. For more information about updating this resource, see PutScalingPolicy.",
  "Dependencies": [
    "ResourceProperties.StepAdjustments"
  ],
  "Parameters": [
    {
      "Name": "AdjustmentType",
      "Type": "Text",
      "Documentation": "Specifies whether the ScalingAdjustment is an absolute number or a percentage of the current capacity. Valid values are ChangeInCapacity, ExactCapacity, and PercentChangeInCapacity.",
      "Required": true
    },
    {
      "Name": "AutoScalingGroupName",
      "Type": "Text",
      "Documentation": "The name or Amazon Resource Name (ARN) of the Auto Scaling Group that you want to attach the policy to.",
      "Required": true
    },
    {
      "Name": "Cooldown",
      "Type": "Text",
      "Documentation": "The amount of time, in seconds, after a scaling activity completes before any further trigger-related scaling activities can start.\nDo not specify this property if you are using the StepScaling policy type.",
      "Required": false
    },
    {
      "Name": "EstimatedInstanceWarmup",
      "Type": "Integer'",
      "Documentation": "The estimated time, in seconds, until a newly launched instance can send metrics to CloudWatch. By default, Auto Scaling uses the cooldown period, as specified in the Cooldown property.\nDo not specify this property if you are using the SimpleScaling policy type.",
      "Required": false
    },
    {
      "Name": "MetricAggregationType",
      "Type": "Text",
      "Documentation": "The aggregation type for the CloudWatch metrics. You can specify Minimum, Maximum, or Average. By default, AWS CloudFormation specifies Average.\nDo not specify this property if you are using the SimpleScaling policy type.",
      "Required": false
    },
    {
      "Name": "MinAdjustmentMagnitude",
      "Type": "Integer'",
      "Documentation": "For the PercentChangeInCapacity adjustment type, the minimum number of instances to scale. The scaling policy changes the desired capacity of the Auto Scaling group by a minimum of this many instances. This property replaces the MinAdjustmentStep property.",
      "Required": false
    },
    {
      "Name": "PolicyType",
      "Type": "Text",
      "Documentation": "An Auto Scaling policy type. You can specify SimpleScaling or StepScaling. By default, AWS CloudFormation specifies SimpleScaling. For more information, see Scaling Policy Types in the Auto Scaling User Guide.",
      "Required": false
    },
    {
      "Name": "ScalingAdjustment",
      "Type": "Integer'",
      "Documentation": "The number of instances by which to scale. The AdjustmentType property determines whether AWS CloudFormation interprets this number as an absolute number (when the ExactCapacityvalue is specified) or as a percentage of the existing Auto Scaling group size (when the PercentChangeInCapacity value is specified). A positive value adds to the current capacity and a negative value subtracts from the current capacity.",
      "Required": false
    },
    {
      "Name": "StepAdjustments",
      "Type": "[StepAdjustments]",
      "Documentation": "A set of adjustments that enable you to scale based on the size of the alarm breach.",
      "Required": false
    }
  ]
}
