{
  "Name": "LaunchConfiguration",
  "Type": "AWS::AutoScaling::LaunchConfiguration",
  "Documentation": "The AWS::AutoScaling::LaunchConfiguration type creates an Auto Scaling launch configuration that can be used by an Auto Scaling group to configure Amazon EC2 instances in the Auto Scaling group.",
  "Dependencies": [
    "ResourceProperties.AutoScalingBlockDeviceMapping"
  ],
  "Parameters": [
    {
      "Name": "AssociatePublicIpAddress",
      "Type": "Bool'",
      "Documentation": "For Amazon EC2 instances in a VPC, indicates whether instances in the Auto Scaling group receive public IP addresses. If you specify true, each instance in the Auto Scaling receives a unique public IP address.\nNote\nIf this resource has a public IP address and is also in a VPC that is defined in the same template, you must use the DependsOn attribute to declare a dependency on the VPC-gateway attachment. For more information, see DependsOn Attribute.",
      "Required": false
    },
    {
      "Name": "BlockDeviceMappings",
      "Type": "[AutoScalingBlockDeviceMapping]",
      "Documentation": "Specifies how block devices are exposed to the instance. You can specify virtual devices and EBS volumes.",
      "Required": false
    },
    {
      "Name": "ClassicLinkVPCId",
      "Type": "Text",
      "Documentation": "The ID of a ClassicLink-enabled VPC to link your EC2-Classic instances to. You can specify this property only for EC2-Classic instances. For more information, see ClassicLink in the Amazon Elastic Compute Cloud User Guide.",
      "Required": false
    },
    {
      "Name": "ClassicLinkVPCSecurityGroups",
      "Type": "[Text]",
      "Documentation": "The IDs of one or more security groups for the VPC that you specified in the ClassicLinkVPCId property.",
      "Required": false
    },
    {
      "Name": "EbsOptimized",
      "Type": "Bool'",
      "Documentation": "Specifies whether the launch configuration is optimized for EBS I/O. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal EBS I/O performance.\nAdditional fees are incurred when using EBS-optimized instances. For more information about fees and supported instance types, see EBS-Optimized Instances in the Amazon EC2 User Guide for Linux Instances.",
      "Required": false
    },
    {
      "Name": "IamInstanceProfile",
      "Type": "Text",
      "Documentation": "Provides the name or the Amazon Resource Name (ARN) of the instance profile associated with the IAM role for the instance. The instance profile contains the IAM role.",
      "Required": false
    },
    {
      "Name": "ImageId",
      "Type": "Text",
      "Documentation": "Provides the unique ID of the Amazon Machine Image (AMI) that was assigned during registration.",
      "Required": true
    },
    {
      "Name": "InstanceId",
      "Type": "Text",
      "Documentation": "The ID of the Amazon EC2 instance you want to use to create the launch configuration. Use this property if you want the launch configuration to use settings from an existing Amazon EC2 instance.\nWhen you use an instance to create a launch configuration, all properties are derived from the instance with the exception of BlockDeviceMapping and AssociatePublicIpAddress. You can override any properties from the instance by specifying them in the launch configuration.",
      "Required": false
    },
    {
      "Name": "InstanceMonitoring",
      "Type": "Bool'",
      "Documentation": "Indicates whether detailed instance monitoring is enabled for the Auto Scaling group. By default, this property is set to true (enabled).\nWhen detailed monitoring is enabled, Amazon CloudWatch (CloudWatch) generates metrics every minute and your account is charged a fee. When you disable detailed monitoring, CloudWatch generates metrics every 5 minutes. For more information, see Monitor Your Auto Scaling Instances in the Auto Scaling Developer Guide.",
      "Required": false
    },
    {
      "Name": "InstanceType",
      "Type": "Text",
      "Documentation": "Specifies the instance type of the EC2 instance.",
      "Required": true
    },
    {
      "Name": "KernelId",
      "Type": "Text",
      "Documentation": "Provides the ID of the kernel associated with the EC2 AMI.",
      "Required": false
    },
    {
      "Name": "KeyName",
      "Type": "Text",
      "Documentation": "Provides the name of the EC2 key pair.",
      "Required": false
    },
    {
      "Name": "PlacementTenancy",
      "Type": "Text",
      "Documentation": "The tenancy of the instance. An instance with a tenancy of dedicated runs on single-tenant hardware and can only be launched in a VPC. You must set the value of this parameter to dedicated if want to launch dedicated instances in a shared tenancy VPC (a VPC with the instance placement tenancy attribute set to default). For more information, see CreateLaunchConfiguration in the Auto Scaling API Reference.\nIf you specify this property, you must specify at least one subnet in the VPCZoneIdentifier property of the AWS::AutoScaling::AutoScalingGroup resource.",
      "Required": false
    },
    {
      "Name": "RamDiskId",
      "Type": "Text",
      "Documentation": "The ID of the RAM disk to select. Some kernels require additional drivers at launch. Check the kernel requirements for information about whether you need to specify a RAM disk. To find kernel requirements, refer to the AWS Resource Center and search for the kernel ID.",
      "Required": false
    },
    {
      "Name": "SecurityGroups",
      "Type": "[Text]",
      "Documentation": "A list that contains the EC2 security groups to assign to the Amazon EC2 instances in the Auto Scaling group. The list can contain the name of existing EC2 security groups or references to AWS::EC2::SecurityGroup resources created in the template. If your instances are launched within VPC, specify Amazon VPC security group IDs.",
      "Required": false
    },
    {
      "Name": "SpotPrice",
      "Type": "Text",
      "Documentation": "The spot price for this autoscaling group. If a spot price is set, then the autoscaling group will launch when the current spot price is less than the amount specified in the template.\nWhen you have specified a spot price for an auto scaling group, the group will only launch when the spot price has been met, regardless of the setting in the autoscaling group's DesiredCapacity.\nFor more information about configuring a spot price for an autoscaling group, see Using Auto Scaling to Launch Spot Instances in the AutoScaling Developer Guide.",
      "Required": false
    },
    {
      "Name": "UserData",
      "Type": "Text",
      "Documentation": "The user data available to the launched EC2 instances.",
      "Required": false
    }
  ]
}
