{
  "Name": "Volume",
  "Type": "AWS::EC2::Volume",
  "Documentation": "The AWS::EC2::Volume type creates a new Amazon Elastic Block Store (Amazon EBS) volume.\nYou can set a deletion policy for your volume to control how AWS CloudFormation handles the volume when the stack is deleted. For Amazon EBS volumes, you can choose to retain the volume, to delete the volume, or to create a snapshot of the volume. For more information, see DeletionPolicy Attribute.",
  "Dependencies": [
    "ResourceProperties.ResourceTag"
  ],
  "Parameters": [
    {
      "Name": "AutoEnableIO",
      "Type": "Bool'",
      "Documentation": "Indicates whether the volume is auto-enabled for I/O operations. By default, Amazon EBS disables I/O to the volume from attached EC2 instances when it determines that a volume's data is potentially inconsistent. If the consistency of the volume is not a concern, and you prefer that the volume be made available immediately if it's impaired, you can configure the volume to automatically enable I/O. For more information, see Working with the AutoEnableIO Volume Attribute in the Amazon EC2 User Guide for Linux Instances.",
      "Required": false
    },
    {
      "Name": "AvailabilityZone",
      "Type": "Text",
      "Documentation": "The Availability Zone in which to create the new volume.",
      "Required": true
    },
    {
      "Name": "Encrypted",
      "Type": "Bool'",
      "Documentation": "Indicates whether the volume is encrypted. Encrypted Amazon EBS volumes can only be attached to instance types that support Amazon EBS encryption. Volumes that are created from encrypted snapshots are automatically encrypted. You cannot create an encrypted volume from an unencrypted snapshot or vice versa. If your AMI uses encrypted volumes, you can only launch the AMI on supported instance types. For more information, see Amazon EBS encryption in the Amazon EC2 User Guide for Linux Instances.",
      "Required": false
    },
    {
      "Name": "Iops",
      "Type": "Integer'",
      "Documentation": "The number of I/O operations per second (IOPS) that the volume supports. For more information about the valid sizes for each volume type, see the Iops parameter for the CreateVolume action in the Amazon EC2 API Reference.",
      "Required": false
    },
    {
      "Name": "KmsKeyId",
      "Type": "Text",
      "Documentation": "The Amazon Resource Name (ARN) of the AWS Key Management Service master key that is used to create the encrypted volume, such as arn:aws:kms:us-east-1:012345678910:key/abcd1234-a123-456a-a12b-a123b4cd56ef. If you create an encrypted volume and don't specify this property, the default master key is used.",
      "Required": false
    },
    {
      "Name": "Size",
      "Type": "Text",
      "Documentation": "The size of the volume, in gibibytes (GiBs). For more information about the valid sizes for each volume type, see the Size parameter for the CreateVolume action in the Amazon EC2 API Reference.\nIf you specify the SnapshotId property, specify a size that is equal to or greater than the snapshot size. If you don't specify a size, Amazon EC2 will use the size of the snapshot as the volume size.",
      "Required": false
    },
    {
      "Name": "SnapshotId",
      "Type": "Text",
      "Documentation": "The snapshot from which to create the new volume.",
      "Required": false
    },
    {
      "Name": "Tags",
      "Type": "[ResourceTag]",
      "Documentation": "An arbitrary set of tags (key–value pairs) for this volume.",
      "Required": false
    },
    {
      "Name": "VolumeType",
      "Type": "Text",
      "Documentation": "The volume type. You can specify standard, io1, or gp2. If you set the type to io1, you must also set the Iops property. For more information about these values and the default value, see the VolumeType parameter for the CreateVolume action in the Amazon EC2 API Reference.",
      "Required": false
    }
  ]
}
