{
  "Name": "EC2Instance",
  "Type": "AWS::EC2::Instance",
  "Documentation": "The AWS::EC2::Instance type creates an Amazon EC2 instance.\nIf an Elastic IP address is attached to your instance, AWS CloudFormation reattaches the Elastic IP address after it updates the instance. For more information about updating stacks, see AWS CloudFormation Stacks Updates.",
  "Dependencies": [
    "ResourceProperties.EC2BlockDeviceMapping",
    "ResourceProperties.NetworkInterface",
    "ResourceProperties.EC2SsmAssociation",
    "ResourceProperties.ResourceTag",
    "ResourceProperties.EC2MountPoint"
  ],
  "Parameters": [
    {
      "Name": "AvailabilityZone",
      "Type": "Text",
      "Documentation": "Specifies the name of the Availability Zone in which the instance is located.\nFor more information about AWS regions and Availability Zones, see Regions and Availability Zones in the Amazon EC2 User Guide.",
      "Required": false
    },
    {
      "Name": "BlockDeviceMappings",
      "Type": "[EC2BlockDeviceMapping]",
      "Documentation": "Defines a set of Amazon Elastic Block Store block device mappings, ephemeral instance store block device mappings, or both. For more information, see Amazon Elastic Block Store or Amazon EC2 Instance Store in the Amazon EC2 User Guide for Linux Instances.",
      "Required": false
    },
    {
      "Name": "DisableApiTermination",
      "Type": "Bool",
      "Documentation": "Specifies whether the instance can be terminated through the API.",
      "Required": false
    },
    {
      "Name": "EbsOptimized",
      "Type": "Bool",
      "Documentation": "Specifies whether the instance is optimized for Amazon Elastic Block Store I/O. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal EBS I/O performance.\nFor more information about the instance types that can be launched as Amazon EBS optimized instances, see Amazon EBS-Optimized Instances in the Amazon Elastic Compute Cloud User Guide. Additional fees are incurred when using Amazon EBS-optimized instances.",
      "Required": false
    },
    {
      "Name": "IamInstanceProfile",
      "Type": "Text",
      "Documentation": "The physical ID (resource name) of an instance profile or a reference to an AWS::IAM::InstanceProfile resource.\nFor more information about IAM roles, see Working with Roles in the AWS Identity and Access Management User Guide.",
      "Required": false
    },
    {
      "Name": "ImageId",
      "Type": "Text",
      "Documentation": "Provides the unique ID of the Amazon Machine Image (AMI) that was assigned during registration.",
      "Required": true
    },
    {
      "Name": "InstanceInitiatedShutdownBehavior",
      "Type": "Text",
      "Documentation": "Indicates whether an instance stops or terminates when you shut down the instance from the instance's operating system shutdown command. You can specify stop or terminate. For more information, see the RunInstances command in the Amazon EC2 API Reference.",
      "Required": false
    },
    {
      "Name": "InstanceType",
      "Type": "Text",
      "Documentation": "The instance type, such as t2.micro. The default type is \"m1.small\". For a list of instance types, see Instance Families and Types.",
      "Required": false
    },
    {
      "Name": "KernelId",
      "Type": "Text",
      "Documentation": "The kernel ID.",
      "Required": false
    },
    {
      "Name": "KeyName",
      "Type": "Text",
      "Documentation": "Provides the name of the Amazon EC2 key pair.",
      "Required": false
    },
    {
      "Name": "Monitoring",
      "Type": "Bool",
      "Documentation": "Specifies whether monitoring is enabled for the instance.",
      "Required": false
    },
    {
      "Name": "NetworkInterfaces",
      "Type": "[NetworkInterface]",
      "Documentation": "A list of embedded objects that describe the network interfaces to associate with this instance.\nNote\nIf this resource has a public IP address and is also in a VPC that is defined in the same template, you must use the DependsOn attribute to declare a dependency on the VPC-gateway attachment. For more information, see DependsOn Attribute.",
      "Required": false
    },
    {
      "Name": "PlacementGroupName",
      "Type": "Text",
      "Documentation": "The name of an existing placement group that you want to launch the instance into (for cluster instances).",
      "Required": false
    },
    {
      "Name": "PrivateIpAddress",
      "Type": "Text",
      "Documentation": "The private IP address for this instance.\nImportant\nIf you make an update to an instance that requires replacement, you must assign a new private IP address. During a replacement, AWS CloudFormation creates a new instance but doesn't delete the old instance until the stack has successfully updated. If the stack update fails, AWS CloudFormation uses the old instance in order to roll back the stack to the previous working state. The old and new instances cannot have the same private IP address.\n(Optional) If you're using Amazon VPC, you can use this parameter to assign the instance a specific available IP address from the subnet (for example, 10.0.0.25). By default, Amazon VPC selects an IP address from the subnet for the instance.",
      "Required": false
    },
    {
      "Name": "RamdiskId",
      "Type": "Text",
      "Documentation": "The ID of the RAM disk to select. Some kernels require additional drivers at launch. Check the kernel requirements for information about whether you need to specify a RAM disk. To find kernel requirements, go to the AWS Resource Center and search for the kernel ID.",
      "Required": false
    },
    {
      "Name": "SecurityGroupIds",
      "Type": "[Text]",
      "Documentation": "A list that contains the security group IDs for VPC security groups to assign to the Amazon EC2 instance. If you specified the NetworkInterfaces property, do not specify this property.",
      "Required": false
    },
    {
      "Name": "SecurityGroups",
      "Type": "[Text]",
      "Documentation": "Valid only for Amazon EC2 security groups. A list that contains the Amazon EC2 security groups to assign to the Amazon EC2 instance. The list can contain both the name of existing Amazon EC2 security groups or references to AWS::EC2::SecurityGroup resources created in the template.",
      "Required": false
    },
    {
      "Name": "SourceDestCheck",
      "Type": "Bool",
      "Documentation": "Controls whether source/destination checking is enabled on the instance. Also determines if an instance in a VPC will perform network address translation (NAT).\nA value of \"true\" means that source/destination checking is enabled, and a value of \"false\" means that checking is disabled. For the instance to perform NAT, the value must be \"false\". For more information, see NAT Instances in the Amazon Virtual Private Cloud User Guide.",
      "Required": false
    },
    {
      "Name": "SsmAssociations",
      "Type": "[EC2SsmAssociation]",
      "Documentation": "The Amazon EC2 Simple Systems Manager (SSM) document and parameter values to associate with this instance. To use this property, you must specify an IAM role for the instance. For more information, see Prerequisites for Remotely Running Commands on EC2 Instances in the Amazon EC2 User Guide for Microsoft Windows Instances.\nNote\nYou can currently associate only one document with an instance.",
      "Required": false
    },
    {
      "Name": "SubnetId",
      "Type": "Text",
      "Documentation": "If you're using Amazon VPC, this property specifies the ID of the subnet that you want to launch the instance into. If you specified the NetworkInterfaces property, do not specify this property.",
      "Required": false
    },
    {
      "Name": "Tags",
      "Type": "[ResourceTag]",
      "Documentation": "An arbitrary set of tags (key–value pairs) for this instance.",
      "Required": false
    },
    {
      "Name": "Tenancy",
      "Type": "Text",
      "Documentation": "The tenancy of the instance that you want to launch. This value can be either \"default\" or \"dedicated\". An instance that has a tenancy value of \"dedicated\" runs on single-tenant hardware and can be launched only into a VPC. For more information, see Using EC2 Dedicated Instances Within Your VPC in the Amazon VPC User Guide.",
      "Required": false
    },
    {
      "Name": "UserData",
      "Type": "Text",
      "Documentation": "Base64-encoded MIME user data that is made available to the instances.",
      "Required": false
    },
    {
      "Name": "Volumes",
      "Type": "[EC2MountPoint]",
      "Documentation": "The Amazon EBS volumes to attach to the instance.\nNote\nBefore detaching a volume, unmount any file systems on the device within your operating system. If you don't unmount the file system, a volume might get stuck in a busy state while detaching.",
      "Required": false
    },
    {
      "Name": "AdditionalInfo",
      "Type": "Text",
      "Documentation": "Reserved.",
      "Required": false
    }
  ]
}
