{
  "Name": "ManagedPolicy",
  "Type": "AWS::IAM::ManagedPolicy",
  "Documentation": "AWS::IAM::ManagedPolicy creates an AWS Identity and Access Management (IAM) managed policy for your AWS account that you can use to apply permissions to IAM users, groups, and roles. For more information about managed policies, see Managed Policies and Inline Policies in the IAM User Guide guide.",
  "Parameters": [
    {
      "Name": "Description",
      "Type": "Text",
      "Documentation": "A description of the policy. For example, you can describe the permissions that are defined in the policy.",
      "Required": false
    },
    {
      "Name": "Groups",
      "Type": "[Text]",
      "Documentation": "The names of groups to attach to this policy.",
      "Required": false
    },
    {
      "Name": "Path",
      "Type": "Text",
      "Documentation": "The path for the policy. By default, the path is /. For more information, see IAM Identifiers in the IAM User Guide guide.",
      "Required": false
    },
    {
      "Name": "PolicyDocument",
      "Type": "Object",
      "Documentation": "Policies that define the permissions for this managed policy. For more information about policy syntax, see IAM Policy Elements Reference in IAM User Guide.",
      "Required": true
    },
    {
      "Name": "Roles",
      "Type": "[Text]",
      "Documentation": "The names of roles to attach to this policy.\nNote\nIf a policy has a Ref to a role and if a resource (such as AWS::ECS::Service) also has a Ref to the same role, add a DependsOn attribute to the resource so that the resource depends on the policy. This dependency ensures that the role's policy is available throughout the resource's lifecycle. For example, when you delete a stack with an AWS::ECS::Service resource, the DependsOn attribute ensures that the AWS::ECS::Service resource can complete its deletion before its role's policy is deleted.",
      "Required": false
    },
    {
      "Name": "Users",
      "Type": "[Text]",
      "Documentation": "The names of users to attach to this policy.",
      "Required": false
    }
  ]
}
