{
  "Name": "ApiGatewayIntegration",
  "Documentation": "Integration is a property of the AWS::ApiGateway::Method resource that specifies information about the target back end that an Amazon API Gateway (API Gateway) method calls.",
  "Dependencies": [
    "ResourceProperties.ApiGatewayIntegrationResponse"
  ],
  "Parameters": [
    {
      "Name": "CacheKeyParameters",
      "Type": "[Text]",
      "Documentation": "A list of request parameters whose values API Gateway will cache.",
      "Required": false
    },
    {
      "Name": "CacheNamespace",
      "Type": "Text",
      "Documentation": "An API-specific tag group of related cached parameters.",
      "Required": false
    },
    {
      "Name": "Credentials",
      "Type": "Text",
      "Documentation": "The credentials required for the integration. To specify an AWS Identity and Access Management (IAM) role that API Gateway assumes, specify the role's Amazon Resource Name (ARN). To require that the caller's identity be passed through from the request, specify arn:aws:iam::*:user/*.\nTo use resource-based permissions on the AWS Lambda (Lambda) function, don't specify this property. Use the AWS::Lambda::Permission resource to permit API Gateway to call the function. For more information, see Allow Amazon API Gateway to Invoke a Lambda Function in the AWS Lambda Developer Guide.",
      "Required": false
    },
    {
      "Name": "IntegrationHttpMethod",
      "Type": "Text",
      "Documentation": "The integration's HTTP method type.",
      "Required": false
    },
    {
      "Name": "IntegrationResponses",
      "Type": "[ApiGatewayIntegrationResponse]",
      "Documentation": "The response that API Gateway provides after a method's back end completes processing a request. API Gateway intercepts the back end's response so that you can control how API Gateway surfaces back-end responses. For example, you can map the back-end status codes to codes that you define.",
      "Required": false
    },
    {
      "Name": "PassthroughBehavior",
      "Type": "Text",
      "Documentation": "Indicates when API Gateway passes requests to the targeted back end. This behavior depends on the request's Content-Type header and whether you defined a mapping template for it.\nFor more information and valid values, see the passthroughBehavior field in the API Gateway API Reference.",
      "Required": false
    },
    {
      "Name": "RequestParameters",
      "Type": "Object",
      "Documentation": "The request parameters that API Gateway sends with the back-end request. Specify request parameters as key-value pairs (string-to-string maps), with a destination as the key and a source as the value.\nSpecify the destination using the following pattern integration.request.location.name, where location is querystring, path, or header, and name is a valid, unique parameter name.\nThe source must be an existing method request parameter or a static value. Static values must be enclosed in single quotation marks and pre-encoded based on their destination in the request.",
      "Required": false
    },
    {
      "Name": "RequestTemplates",
      "Type": "Object",
      "Documentation": "A map of Apache Velocity templates that are applied on the request payload. The template that API Gateway uses is based on the value of the Content-Type header sent by the client. The content type value is the key, and the template is the value (specified as a string), such as the following snippet:\nFor more information about templates, see API Gateway API Request and Response Payload-Mapping Template Reference in the API Gateway Developer Guide.",
      "Required": false
    },
    {
      "Name": "Type",
      "Type": "Text",
      "Documentation": "The type of back end your method is running, such as HTTP, AWS, or MOCK. For valid values, see the type property in the Amazon API Gateway REST API Reference.",
      "Required": true
    },
    {
      "Name": "Uri",
      "Type": "Text",
      "Documentation": "The integration's Uniform Resource Identifier (URI).\nIf you specify HTTP for the Type property, specify the API endpoint URL.\nIf you specify MOCK for the Type property, don't specify this property.\nIf you specify AWS for the Type property, specify an AWS service that follows the form: arn:aws:apigateway:region:subdomain.service|service:path|action/service_api. For example, a Lambda function URI follows the form: arn:aws:apigateway:region:lambda:path/path. The path is usually in the form /2015-03-31/functions/LambdaFunctionARN/invocations. For more information, see the uri property of the Integration resource in the Amazon API Gateway REST API Reference.",
      "Required": false
    }
  ]
}
