{
  "Name": "APIGatewayDeploymentStageDescription",
  "Documentation": "StageDescription is a property of the AWS::ApiGateway::Deployment resource that configures an Amazon API Gateway (API Gateway) deployment stage.",
  "Dependencies": [
    "ResourceProperties.APIGatewayDeploymentStageDescriptionMethodSetting"
  ],
  "Parameters": [
    {
      "Name": "CacheClusterEnabled",
      "Type": "Bool'",
      "Documentation": "Indicates whether cache clustering is enabled for the stage.",
      "Required": false
    },
    {
      "Name": "CacheClusterSize",
      "Type": "Text",
      "Documentation": "The size of the stage's cache cluster.",
      "Required": false
    },
    {
      "Name": "CacheDataEncrypted",
      "Type": "Bool'",
      "Documentation": "Indicates whether the cached responses are encrypted.",
      "Required": false
    },
    {
      "Name": "CacheTtlInSeconds",
      "Type": "Integer'",
      "Documentation": "The time-to-live (TTL) period, in seconds, that specifies how long API Gateway caches responses.",
      "Required": false
    },
    {
      "Name": "CachingEnabled",
      "Type": "Bool'",
      "Documentation": "Indicates whether responses are cached and returned for requests. You must enable a cache cluster on the stage to cache responses. For more information, see Enable API Gateway Caching in a Stage to Enhance API Performance in the API Gateway Developer Guide.",
      "Required": false
    },
    {
      "Name": "ClientCertificateId",
      "Type": "Text",
      "Documentation": "The identifier of the client certificate that API Gateway uses to call your integration endpoints in the stage.",
      "Required": false
    },
    {
      "Name": "DataTraceEnabled",
      "Type": "Bool'",
      "Documentation": "Indicates whether data trace logging is enabled for methods in the stage. API Gateway pushes these logs to Amazon CloudWatch Logs.",
      "Required": false
    },
    {
      "Name": "Description",
      "Type": "Text",
      "Documentation": "A description of the purpose of the stage.",
      "Required": false
    },
    {
      "Name": "LoggingLevel",
      "Type": "Text",
      "Documentation": "The logging level for this method. For valid values, see the loggingLevel property of the Stage resource in the Amazon API Gateway API Reference.",
      "Required": false
    },
    {
      "Name": "MethodSettings",
      "Type": "APIGatewayDeploymentStageDescriptionMethodSetting",
      "Documentation": "Configures settings for all of the stage's methods.",
      "Required": false
    },
    {
      "Name": "MetricsEnabled",
      "Type": "Bool'",
      "Documentation": "Indicates whether Amazon CloudWatch metrics are enabled for methods in the stage.",
      "Required": false
    },
    {
      "Name": "StageName",
      "Type": "Text",
      "Documentation": "The name of the stage, which API Gateway uses as the first path segment in the invoke Uniform Resource Identifier (URI).",
      "Required": false
    },
    {
      "Name": "ThrottlingBurstLimit",
      "Type": "Integer'",
      "Documentation": "The number of burst requests per second that API Gateway permits across all APIs, stages, and methods in your AWS account. For more information, see Manage API Request Throttling in the API Gateway Developer Guide.",
      "Required": false
    },
    {
      "Name": "ThrottlingRateLimit",
      "Type": "Double'",
      "Documentation": "The number of steady-state requests per second that API Gateway permits across all APIs, stages, and methods in your AWS account. For more information, see Manage API Request Throttling in the API Gateway Developer Guide.",
      "Required": false
    },
    {
      "Name": "Variables",
      "Type": "Object",
      "Documentation": "A map that defines the stage variables. Variable names must consist of alphanumeric characters, and the values must match the following regular expression: [A-Za-z0-9-._~:/?#&amp;=,]+.",
      "Required": false
    }
  ]
}
