{
  "Name": "KinesisFirehoseS3DestinationConfiguration",
  "Documentation": "S3DestinationConfiguration is a property of the AWS::KinesisFirehose::DeliveryStream resource and the Amazon Kinesis Firehose DeliveryStream ElasticsearchDestinationConfiguration and Amazon Kinesis Firehose DeliveryStream RedshiftDestinationConfiguration properties that specifies an Amazon Simple Storage Service (Amazon S3) destination to which Amazon Kinesis Firehose (Firehose) delivers data.",
  "Dependencies": [
    "ResourceProperties.KinesisFirehoseBufferingHints",
    "ResourceProperties.KinesisFirehoseCloudWatchLoggingOptions",
    "ResourceProperties.KinesisFirehoseS3EncryptionConfiguration",
    "Types"
  ],
  "Parameters": [
    {
      "Name": "BucketARN",
      "Type": "Text",
      "Documentation": "The Amazon Resource Name (ARN) of the S3 bucket to send data to.",
      "Required": true
    },
    {
      "Name": "BufferingHints",
      "Type": "KinesisFirehoseBufferingHints",
      "Documentation": "Configures how Firehose buffers incoming data while delivering it to the S3 bucket.",
      "Required": true
    },
    {
      "Name": "CloudWatchLoggingOptions",
      "Type": "KinesisFirehoseCloudWatchLoggingOptions",
      "Documentation": "The Amazon CloudWatch Logs logging options for the delivery stream.",
      "Required": false
    },
    {
      "Name": "CompressionFormat",
      "Type": "KinesisFirehoseS3CompressionFormat",
      "Documentation": "The type of compression that Firehose uses to compress the data that it delivers to the S3 bucket. For valid values, see the CompressionFormat content for the S3DestinationConfiguration data type in the Amazon Kinesis Firehose API Reference.",
      "Required": true
    },
    {
      "Name": "EncryptionConfiguration",
      "Type": "KinesisFirehoseS3EncryptionConfiguration",
      "Documentation": "Configures Amazon Simple Storage Service (Amazon S3) server-side encryption. Firehose uses AWS Key Management Service (AWS KMS) to encrypt the data that it delivers to your S3 bucket.",
      "Required": false
    },
    {
      "Name": "Prefix",
      "Type": "Text",
      "Documentation": "A prefix that Firehose adds to the files that it delivers to the S3 bucket. The prefix helps you identify the files that Firehose delivered.",
      "Required": true
    },
    {
      "Name": "RoleARN",
      "Type": "Text",
      "Documentation": "The ARN of an AWS Identity and Access Management (IAM) role that grants Firehose access to your S3 bucket and AWS KMS (if you enable data encryption).\nFor more information, see Grant Firehose Access to an Amazon S3 Destination in the Amazon Kinesis Firehose Developer Guide.",
      "Required": true
    }
  ]
}
