{
  "Name": "DBSecurityGroupIngress",
  "Type": "AWS::RDS::DBSecurityGroupIngress",
  "Documentation": "The AWS::RDS::DBSecurityGroupIngress type enables ingress to a DBSecurityGroup using one of two forms of authorization. First, EC2 or VPC security groups can be added to the DBSecurityGroup if the application using the database is running on EC2 or VPC instances. Second, IP ranges are available if the application accessing your database is running on the Internet. For more information about DB security groups, see Working with DB security groups\nThis type supports updates. For more information about updating stacks, see AWS CloudFormation Stacks Updates.\nFor details about the settings for DB security group ingress, see AuthorizeDBSecurityGroupIngress.",
  "Parameters": [
    {
      "Name": "CIDRIP",
      "Type": "Text",
      "Documentation": "The IP range to authorize.\nFor an overview of CIDR ranges, go to the Wikipedia Tutorial.\nType: String\nUpdate requires: No interruption",
      "Required": false
    },
    {
      "Name": "DBSecurityGroupName",
      "Type": "Text",
      "Documentation": "The name (ARN) of the AWS::RDS::DBSecurityGroup to which this ingress will be added.\nType: String",
      "Required": true
    },
    {
      "Name": "EC2SecurityGroupId",
      "Type": "Text",
      "Documentation": "The ID of the VPC or EC2 security group to authorize.\nFor VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.\nType: String",
      "Required": false
    },
    {
      "Name": "EC2SecurityGroupName",
      "Type": "Text",
      "Documentation": "The name of the EC2 security group to authorize.\nFor VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.\nType: String",
      "Required": false
    },
    {
      "Name": "EC2SecurityGroupOwnerId",
      "Type": "Text",
      "Documentation": "The AWS Account Number of the owner of the EC2 security group specified in the EC2SecurityGroupName parameter. The AWS Access Key ID is not an acceptable value.\nFor VPC DB security groups, use EC2SecurityGroupId. For EC2 security groups, use EC2SecurityGroupOwnerId and either EC2SecurityGroupName or EC2SecurityGroupId.\nType: String",
      "Required": false
    }
  ]
}
